# Задача 1. Сисадмин
#
# Вы работаете системным администратором в одной компании. На диске каждого сотрудника компании в специальной папке access лежит
# файл admin.bat. Этот файл предназначен для вас, и вам нужен путь до этого файла, причём как относительный,
# так и абсолютный. Недолго думая, вы решили написать небольшой скрипт, который закинете по сети к этому файлу.
#
#
#
# Напишите программу, которая выводит на экран относительный и абсолютный пути до файла admin.bat.
#
#
#
# Пример результата:
#
# Абсолютный путь до файла: C:\Users\Roman\PycharmProjects\Skillbox\access\admin.bat
#
#
#
# Относительный путь до файла: Skillbox\access\admin.bat
#
#
#
import os

rel_path = os.path.join("access", "admin.bat")
abs_path = os.path.abspath(rel_path)
print("Абсолютный путь до файла:", abs_path)
print("Относительный путь до файла:", rel_path)

# Задача 2. Содержимое
#
# Выберите любую директорию на своём диске и затем напишите программу, выводящую на экран абсолютные пути к файлам и папкам,
# которые находятся внутри этой директории.
#
#
#
# Результат программы на примере директории проекта python_basic:
#
#
#
# Содержимое каталога G:\PycharmProjects\python_basic
#
#     G:\PycharmProjects\python_basic\.git
#
#     G:\PycharmProjects\python_basic\.idea
#
#     G:\PycharmProjects\python_basic\Module14
#
#     G:\PycharmProjects\python_basic\Module15
#
#     G:\PycharmProjects\python_basic\Module16
#
#     G:\PycharmProjects\python_basic\Module17
#
#     G:\PycharmProjects\python_basic\Module18
#
#     G:\PycharmProjects\python_basic\Module19
#
#     G:\PycharmProjects\python_basic\Module20
#
#     G:\PycharmProjects\python_basic\Module21
#
#     G:\PycharmProjects\python_basic\Module22
#
#
#

for path in os.listdir('..'):
    print(os.path.join(os.path.abspath('..'), path))

# Задача 3. Корень диска
#
# Напишите программу, которая выводит на экран только корень диска, на котором запущен скрипт.
# Учтите, что скрипт может быть запущен где угодно и при любой вложенности папок.
#
#
#
# Результат программы на примере диска G:
#
# Корень диска: G:\

# Решение для Windows:
print("Корень диска:", os.path.abspath(os.sep).split(os.sep)[0])

# Решение для UNIX:
print("Корень диска:", os.sep)