# Задача 1. Заказ
#
# После того, как человек сделал заказ в интернет-магазине, ему на почту приходит оповещение с его именем и номером заказа.
#
# Напишите программу, которая получает на вход имя и код заказа, а затем выводит на экран соответствующее сообщение.
# Для решения используйте строковый метод format.
#
#
#
# Пример:
#
# Имя: Иван
#
# Номер заказа: 10948
#
#
#
# Здравствуйте, Иван! Ваш номер заказа: 10948. Приятного дня!
#
#
#

name = input("Имя: ")
order_id = input("Номер заказа: ")

print("Здравствуйте, {name}! Ваш номер заказа: {id}. Приятного дня!".format(name=name, id=order_id))

# Задача 2. Долги
#
# Один наш друг занял у нас определённую сумму денег и всё никак не может их вернуть. А деньги нам нужны.
# Поэтому мы решили написать небольшой скрипт-напоминалку, который, возможно, разбудит его совесть.
#
# Напишите программу, которая получает на вход имя и долг, а затем выводит на экран сообщение,
# где имя повторяется несколько раз (и долг, возможно, тоже). Используйте числа в названиях ключей.
#
#
#
# Пример:
#
# Введите имя: Том
#
# Введите долг: 100
#
# Том! Том, привет! Как дела, Том? Где мои 100 рублей? Том!
#
#
#

name = input("Имя: ")
debt = input("Долг: ")

print("{name}! {name}, привет! Как дела, {name}? Где мои {debt} рублей? {name}!".format(name=name, debt=debt))

# Задача 3. IP-адрес
#
# IP-адрес компьютера состоит из 4 чисел, разделённых точкой. Каждое число находится в диапазоне от 0 до 255 (включительно).
#
#
#
# Пример правильного адреса: 192.168.1.0
#
# Пример неправильного адреса: 192.168.300.0
#
#
#
# Напишите программу, которая получает на вход 4 числа и выводит на экран IP-адрес.
# Используйте переменную ip_address в качестве шаблона. Обеспечьте контроль ввода.

ip_address = "{0}.{1}.{2}.{3}"
count = 0
numbers = []
while count < 4:
    new_number = int(input("Введите число: "))
    if 0 <= new_number <= 255:
        numbers.append(new_number)
        count += 1

print(ip_address.format(*numbers))
# * полезный инструмент, но и без него можно справиться, вручную прописав элементы по индексам
print(ip_address.format(numbers[0], numbers[1], numbers[2], numbers[3]))
