# Задача 1. Словарь квадратов чисел
#
# На вход программе поступает целое число num. Напишите программу создания словаря, который включает в себя ключи от 1 до num,
# а значениями соответствующего ключа будет значение ключа в квадрате.
#
#
#
# Пример:
#
# Введите целое число: 5
#
#
#
# Результат: {1: 1, 2: 4, 3: 9, 4: 16, 5: 25}
#
#
#

number = int(input("Введите целое число: "))
result = {}
for i in range(1, number + 1):
    result[i] = i ** 2
print("Результат:", result)

# Задача 2. Студент
#
# Пользователь вводит фамилию, имя студента, город проживания, вуз, в котором он учится, и все его оценки.
# Всё вводится в одну строку через пробел. Напишите программу, которая по этой информации составит словарь и выведет его на экран.
#
#
#
# Пример:
#
# Введите информацию о студенте через пробел (имя, фамилия, город, место учёбы, оценки): Илья Иванов Москва МГУ 5 4 4 4 5
#
#
#
# Результат:
#
# Имя - Илья
#
# Фамилия - Иванов
#
# Город - Москва
#
# Место учёбы - МГУ
#
# Оценки - [5, 4, 4, 4, 5]
#
#
#

user_info = input("Введите информацию о студенте через пробел (имя, фамилия, город, место учёбы, оценки): ").split()
user_info_in_dict = {
    "Имя": user_info[0],
    "Фамилия": user_info[1],
    "Город": user_info[2],
    "Место учёбы": user_info[3],
    "Оценки": [int(grade) for grade in list(user_info[4:])]  # срез 4+ даст нам строку с оценками, list превратит строку в список оценок
    # а с помощью генератора мы сможем превратить str числа в int числа, чтобы с ними можно было при желании работать как с числами
}

for key in user_info_in_dict:
    print(f"{key} - {user_info_in_dict[key]}")

# Задача 3. Контакты
#
# Энтузиаст Степан, купив новый телефон, решил написать для него свою собственную операционную систему.
# И, конечно же, первое, что он захотел в ней реализовать, — это телефонная книга.
#
# Напишите программу, которая запрашивает у пользователя имя контакта и номер телефона,
# добавляет их в словарь и выводит на экран текущий словарь контактов. Запрос на добавление идёт бесконечно
# (но можно задать своё условие для завершения программы).
# Обеспечьте контроль ввода: если это имя уже есть в словаре, то выведите соответствующее сообщение.
#
#
#
# Пример:
#
# Текущие контакты на телефоне:
#
# <Пусто>
#
# Введите имя: Иван
#
# Введите номер телефона: 100200300
#
#
#
# Текущие контакты на телефоне:
#
# Иван  100200300
#
#
#
# Введите имя: Лена
#
# Введите номер телефона: 8005555522
#
#
#
# Текущие контакты на телефоне:
#
# Иван  100200300
#
# Лена  8005555522
#
#
#
# Введите имя: Иван
#
# Ошибка: такое имя уже существует.

current_contacts = {}
while True:
    print("Текущие контакты на телефоне:")
    if current_contacts:
        for name in current_contacts:
            print(name, current_contacts[name])
    else:
        print("<Пусто>")
    new_contact = input("Введите имя (для остановки введите пустую строку): ")
    new_telephone = int(input("Введите номер телефона: "))
    if new_contact in current_contacts:
        print("Ошибка: такое имя уже существует.")
    else:
        current_contacts[new_contact] = new_telephone

