# Задача 1. Таблица степеней
#
# Аркадий как-то раз написал программу для вывода таблицы степеней для определённых чисел. Недавно он узнал про такую штуку,
# как списки, и решил программу немного переписать, а заодно усовершенствовать её. По его задумке, вначале есть всего три числа:
# 3, 7 и 5, а затем с помощью бесконечного цикла программа запрашивает новое число, закидывает его
# в конец текущего списка чисел и выводит вторую, третью и четвёртую степень каждого числа текущего списка.
# Вот какая программа получилась у Аркадия:
#
#
#
# numbers = 3,7,5
#
# while True:
#
#  number = int(input('Новое число: '))
#
#  numbers.append(numbers)
#
#  print('Текущий список чисел:', numbers)
#
#  for _ in number:
#
#    print(i ** 2, i ** 3, i ** 4)
#
#  print()
#
#
#
# Однако, к сожалению, эта программа у него не заработала. Помогите Аркадию исправить ошибки в коде.
# Убедитесь, что программа работает верно.
#
#
#
# Пример верного результата:
#
# Новое число: 1
#
# Текущий список чисел: [3, 7, 5, 1]
#
# 9 27 81
#
# 49 343 2401
#
# 25 125 625
#
# 1 1 1
#
#
#
# Новое число: 2
#
# Текущий список чисел: [3, 7, 5, 1, 2]
#
# 9 27 81
#
# 49 343 2401
#
# 25 125 625
#
# 1 1 1
#
# 4 8 16
#
#
#

numbers = [3, 7, 5]

while True:

    number = int(input('Новое число: '))

    numbers.append(number)

    print('Текущий список чисел:', numbers)

    for i in numbers:
        print(i ** 2, i ** 3, i ** 4, sep="\t")

    print()

# Задача 2. Очень простая задача
#
# У вас есть список numbers. Напишите программу, которая заполняет список числами от 0 до 100 и выводит его на экран.
#
#
#

numbers = []
for number in range(101):
    numbers.append(number)
print(numbers)

# Задача 3. Контроль
#
# В любой компании есть список сотрудников. Руководство одной компании хочет знать, на рабочем месте ли сейчас сотрудник.
# У каждого сотрудника есть пропуск со своим ID-номером (это положительное число), список активных пропусков сотрудников известен заранее.
#
# Напишите программу, которая сначала запрашивает у пользователя количество сотрудников в офисе,
# ID их пропусков, а затем запрашивает ID пропуска, который нужно найти в этом списке. Если такой есть,
# то вывести «Сотрудник на месте», а иначе «Сотрудник не работает!».
#
#
#
# Пример:
#
# Кол-во сотрудников в офисе: 4
#
# ID сотрудника: 10
#
# ID сотрудника: 20
#
# ID сотрудника: 30
#
# ID сотрудника: 40
#
# Какой ID ищем? 35
#
# Сотрудник не работает!

count_of_workers = int(input("Кол-во сотрудников в офисе: "))
workers_id = []
for _ in range(count_of_workers):
    worker_id = int(input("ID сотрудника: "))
    workers_id.append(worker_id)

search_id = int(input("Какого сотрудника ищем? "))

search = False
for id in workers_id:
    if id == search_id:
        search = True

if search:
    print("Сотрудник работает!")
else:
    print("Сотрудник не работает!")


if search_id not in workers_id:  # Благодаря оператору in поиск можно упростить
    print("Сотрудник не работает!")
else:
    print("Сотрудник работает!")
