# Задача 1. Циклы — это сложно?
#
# Даша начала проходить циклы. Она написала программу, которая просто должна считать сумму чисел до тех пор,
# пока мы не ввели 0, но что-то пошло не так.
#
# number = int(input(‘Введите число: ’))
# While number <= 0:
#  summ += number
#  number = int(input(‘Введите число: ’))
# print(Summ)
#
#
# Скопируйте программу в редактор, исправьте её и убедитесь в правильности работы программы.
#
#
#

number = int(input("Введите число: "))
summ = 0
while number != 0:
    summ += number
    number = int(input("Введите число: "))

print(summ)



# Задача 2. Закономерности
#
# Арина считает, что всё в нашей жизни закономерно. И она в очередной раз убедилась в этом, когда узнала своё домашнее задание по математике.
#
# Напишите программу, которая выводит на экран вот такую последовательность чисел (каждое число в новой строчке):
#
# 7 14 21 28 35 42 49 56 63 70 77 84 91 98
# Найдите закономерность и выведите значения в терминал в цикле.

number = 0
while number < 98:
    number += 7
    print(number)

# Вариант с выводом чисел в одну строку:
number = 0
while number < 98:
    number += 7
    print(number, end=' ')
print()